#include "main.h"

/* Логіка 1:
		Для запису в Storage Register відповідного зсувного реєстру
негативний фронт формуєтсья на окремих пінах MCU(тобто до кожного входу
STCLK(ST_CP) подімкнений окремий пін від mcu). Таким чином дані записуютсья в
необобхідний реєстр.
	1. Предаємо по spi дані для включення відповідного розряду.
	Формуємо негативний фронт для запису в stoage register. 
	2. Предаємо по spi дані для для відображення на ідикаторі
	Формуємо негативний фронт для запису в stoage register.
*/

void Timer_Init()
{
	//TIMER0 init
	TCCR0 |= (1<<CS02)|(0<<CS00);
	TIMSK |= (1<<TOIE0);
}

// Для переключення розрядів
ISR(TIMER0_OVF_vect)
{
	DI_Update();
}

int main(void)
{
	DI_Init();
	Timer_Init();
	SPI_Init();
	
	uint32_t i = 0;

	sei();
	while (1) 
	{
		for(i = 9990; i < 100000; i++)
		{
			DI_Output(i, 2);
			_delay_ms(300);
		}
		i=0;
    }
}
